<!-- dflook/terraform-github-actions {"workspace":"default","backend_type":"local","backend":"c3bc7f2cbbdfaf0b98b426d91e3795bb2868003191b4904456b20216b1aeba7d","plan_job_ref":"Job Terraform Plan #14 at https://github.com/ibrt2016/terraform-azure-web-mybob220/actions/runs/10328388205","plan_out_hash":"620e5d4da1489733099b9b9c8475a46a7036544910914f9467ea9c8c1ab75605","plan_hash":"bad075a875bc136144b60d0491c1630ba5e088d06307842ce28b5dcf71c3779d","plan_text_format":"diff","version":"1.44.0"} -->
Terraform plan in __.__
<details>
<summary>Plan: 2 to add, 0 to change, 0 to destroy.</summary>

```diff
Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
+   create

Terraform will perform the following actions:

  # module.azure_virtual_network.azurerm_virtual_network.main_vnet will be created
+   resource "azurerm_virtual_network" "main_vnet" {
+       address_space       = [
+           "10.30.0.0/16",
        ]
+       dns_servers         = []
+       guid                = (known after apply)
+       id                  = (known after apply)
+       location            = "eastus"
+       name                = "vnet-mybob220-client-use-prod-005"
+       resource_group_name = "rg-mybob220-client-prod-005"
+       subnet              = (known after apply)
+       tags                = {
+           "CostCenter"  = "03444"
+           "Criticality" = "High"
+           "Entity"      = "JP"
+           "Owner"       = "BobTayara"
+           "env"         = "prod"
+           "stack"       = "mybob220"
        }
    }

  # module.rg.azurerm_resource_group.main_rg will be created
+   resource "azurerm_resource_group" "main_rg" {
+       id       = (known after apply)
+       location = "eastus"
+       name     = "rg-mybob220-client-prod-005"
+       tags     = {
+           "env"   = "prod"
+           "stack" = "mybob220"
        }
    }

Plan: 2 to add, 0 to change, 0 to destroy.
```
</details>

:memo: Plan generated in [Terraform Plan #14](https://github.com/ibrt2016/terraform-azure-web-mybob220/actions/runs/10328388205)